Repository: lareferencia/lareferencia-repository-dashboard
Catalog: angular/src/locale/messages.*.xlf
Languages: es

source: Users
es: Usuarios

source: Groups
es: Grupos

source: Group Info
es: Información del grupo

source: Name *
es: Nombre *

source: Longest name
es: Nombre más largo

source: Save
es: Guardar

source: Sync
es: Sincronizar

source: Import acronym from existing repositories
es: Importar acrónimos de repositorios existentes

source: Search group
es: Buscar grupo

source: Showing {first} to {last} of {totalRecords} entries
es: Mostrando de {first} a {last} de {totalRecords} entradas

source: Name <p-sortIcon field="name"></p-sortIcon>
es: Nombre <p-sortIcon field="name"></p-sortIcon>

source: Delete
es: Borrar

source: Create group
es: Crear grupo

source: Group list
es: Lista de grupos

source: Import groups
es: Importar grupos

source: Loading...
es: Cargando...

source: Success
es: Éxito

source: Select file
es: Seleccionar archivo

source: No file selected
es: Ningún fichero seleccionado

source: User Info
es: Información del usuario

source: Username *
es: Nombre de usuario *

source: This field is required
es: Este campo es obligatorio

source: The field needs at least 2 characters
es: El campo necesita al menos 2 caracteres

source: Name
es: Nombre

source: Email *
es: Correo electrónico *

source: The entered value is not correct
es: El valor introducido no es correcto

source: Password *
es: Contraseña *

source: The field needs at least 6 characters
es: El campo necesita al menos 6 caracteres

source: Institutional phone
es: Teléfono institucional

source: Affiliation
es: Afiliación

source: Group Membership
es: Afiliación a grupos

source: Available Groups
es: Grupos disponibles

source: Search username
es: Buscar nombre de usuario

source: Username <p-sortIcon field="username"></p-sortIcon>
es: Nombre de usuario <p-sortIcon field="username"></p-sortIcon>

source: Create user
es: Crear usuario

source: User list
es: Lista de usuarios

source: Import users
es: Importar usuarios

source: Harvestings
es: Cosechas

source: Clear
es: Limpiar

source: Filter
es: Filtro

source: Harvesting history
es: Historial de cosecha

source: In the graph it is possible to view the results of the harvestingss performed. The chart shows three metrics, which are: valid, invalid and transformed records. Valid records are those that are in accordance with the current mandatory harvest rules of the repository. Invalid records are those that do not comply with the mandatory harvest rules of the repository. Finally, the transformed records inform the number of documents that were collected. It is possible to use the filter below this graph to select the date range and view specific harvests. The graph displays harvests in groups of ten, so it is possible to navigate within the graph if the selected interval has more than ten harvests. Use the 'clear' button to return the graph to its initial state, showing the harvests from the last two years.
es: El gráfico presenta los resultados de las cosechas realizadas, mostrando tres métricas clave: registros válidos, inválidos y transformados. Los registros válidos son aquellos que cumplen con todas las reglas de validación obligatorias en el Nodo Nacional mientras que los registros inválidos son aquellos que no se ajustan a dichas reglas. Por último, los registros transformados reflejan el número de documentos que han sido sometidos a algún tipo de transformación. Para facilitar el análisis, puede utilizar el filtro ubicado debajo del gráfico y seleccionar un intervalo de fechas específico, de esta manera podrá visualizar cosechas concretas. Cabe destacar que el gráfico organiza las cosechas en grupos de diez, lo que permite navegar fácilmente en caso de que el intervalo seleccionado contenga más de diez cosechas. Si desea regresar al estado inicial del gráfico y visualizar las cosechas de los dos últimos años, simplemente haga clic en el botón "limpiar".

source: Harvesting table
es: Tabla de cosecha

source: This table is the history of each harvest performed. Each harvest generates a unique identifier, which is represented below as an ID. It shows numerically how many records were validated, invalidated and transformed in each harvest performed. You can also view the start and end time of the harvest process, as well as download the .csv file containing all the information described. When clicking on “validations”, a page will be presented containing the level of compliance, in percentage, the harvest rules of the BDTD. Only the validations of the last harvestingss made will be available for viewing, therefore, it will not be possible to view the granular validation of the oldest harvestingss.
es: Esta tabla muestra el historial de cada cosecha realizada, con un identificador único para cada una (columna ID). Se detalla la cantidad de los registros disponibles, válidos, inválidos y transformados en cada cosecha. Además, se muestra la hora de inicio y fin del proceso de cosecha, y se ofrece la opción de descargar el archivo .csv con toda la información detallada. Al hacer clic en "Ver validación", accederá a una página que muestra el nivel de cumplimiento, expresado en porcentaje, de las reglas de validación establecidas en el Nodo Nacional. Tenga en cuenta que solo podrá visualizar las validaciones de la última cosecha realizada, por lo que no será posible examinar detalladamente las validaciones de cosechas más antiguas

source: Harvested Record
es: Registro cosechado

source: Valid records
es: Registros válidos

source: Invalid records
es: Registros no válidos

source: Transformed
es: Transformado

source: Start<p-sortIcon field="startTime"></p-sortIcon>
es: Inicio<p-sortIcon field="startTime"></p-sortIcon>

source: End<p-sortIcon field="endTime"></p-sortIcon>
es: Fin<p-sortIcon field="endTime"></p-sortIcon>

source: See validation
es: Ver validación

source: Old harvesting, data not available
es: Cosecha antigua, datos no disponibles

source: Harvesting not found
es: Cosecha no encontrada

source: Welcome
es: Bienvenido

source: Dashboard for managers
es: Dashboard para administradores

source: ¿What's on the platform?
es: ¿Qué hay en la plataforma?

source: Information about the <b>harvesting</b> of deposit documents.
es: Información sobre la cosecha de documentos.<b></b>

source: Information about the <b>documents validation.</b>
es: Información sobre la validación de documentos.<b></b>

source: Informative <b>statistics and graphics.</b>
es: Estadísticas y gráficos informativos.<b></b>

source: Services
es: Servicios

source: Data harvesting
es: Cosecha de metadatos

source: Validations
es: Validación de metadatos

source: In progress
es: En curso

source: Home
es: Inicio

source: Validation
es: Validación

source: Account
es: Cuenta

source: Edit Info
es: Editar información

source: email
es: Correo electrónico

source: Telephone
es: Teléfono

source: Update
es: Actualización

source: {{title}} - Read more
es: {{title}} - Seguir leyendo

source: {VAR_SELECT, select, true {Mandatory rule: Yes} false {Mandatory rule: No}}
es: {VAR_SELECT, select, true {Regla obligatoria: Sí} false {Regla obligatoria: No}}

source: Zero only <i class="pi pi-question-circle text-xs" i18n-pTooltip pTooltip="Number of valid occurrences for a rule to be valid"></i>
es: Sólo cero <i class="pi pi-question-circle text-xs" i18n-pTooltip pTooltip="Number of valid occurrences for a rule to be valid"></i>

source: Number of valid occurrences for a rule to be valid
es: Número de ocurrencias válidas para que una regla sea válida

source: One only <i class="pi pi-question-circle text-xs" i18n-pTooltip pTooltip="Number of valid occurrences for a rule to be valid"></i>
es: Sólo uno <i class="pi pi-question-circle text-xs" i18n-pTooltip pTooltip="Number of valid occurrences for a rule to be valid"></i>

source: Zero or more <i class="pi pi-question-circle text-xs" i18n-pTooltip pTooltip="Number of valid occurrences for a rule to be valid"></i>
es: Cero o más <i class="pi pi-question-circle text-xs" i18n-pTooltip pTooltip="Number of valid occurrences for a rule to be valid"></i>

source: One or more <i class="pi pi-question-circle text-xs" i18n-pTooltip pTooltip="Number of valid occurrences for a rule to be valid"></i>
es: Uno o varios <i class="pi pi-question-circle text-xs" i18n-pTooltip pTooltip="Number of valid occurrences for a rule to be valid"></i>

source: All <i class="pi pi-question-circle text-xs" i18n-pToolTip pTooltip="Number of valid occurrences for a rule to be valid"></i>
es: Todos <i class="pi pi-question-circle text-xs" i18n-pToolTip pTooltip="Number of valid occurrences for a rule to be valid"></i>

source: Export CSV
es: Exportar CSV

source: Ocurrence <p-sortIcon field="value"></p-sortIcon>
es: Ocurrencia <p-sortIcon field="value"></p-sortIcon>

source: Amount <p-sortIcon field="count"></p-sortIcon>
es: Cantidad <p-sortIcon field="count"></p-sortIcon>

source: Records that contain the invalid rule
es: Registros que contienen la regla inválida

source: Search identifier
es: Identificador de búsqueda

source: clear
es: Limpiar

source: Identifier
es: Identificador

source: Transformed
es: Transformado

source: Details
es: Detalles

source: {VAR_SELECT, select, true {Invalid} false {Valid}}
es: {VAR_SELECT, select, true {Invalido} false {Valido}}

source: {VAR_SELECT, select, true {Yes} false {No}}
es: {VAR_SELECT, select, true {Sí} false {No}}

source: Valid Record
es: Registro válido

source: Invalid Record
es: Registro no válido

source: Invalid ocurrence
es: Ocurrencia inválida

source: Valid ocurrence
es: Ocurrencia válida

source: Result of the evaluation of rules for:
es: Resultado de la evaluación de las reglas para:

source: Valid rules
es: Reglas válidas

source: Invalid rules
es: Reglas no válidas

source: Identifier <p-columnFilter field="identifier" display="menu" [showAddButton]="false" [showMatchModes]="false" [showOperator]="false" [showClearButton]="false"><ng-template pTemplate="filter"><input type="text" pInputText [(ngModel)]="filter.oaiIdentifier" i18n-placeholder placeholder="Identifier" (keydown.enter)="applyFilter()"/></ng-template></p-columnFilter>
es: Identificador <p-columnFilter field="identifier" display="menu" [showAddButton]="false" [showMatchModes]="false" [showOperator]="false" [showClearButton]="false"><ng-template pTemplate="filter"><input type="text" pInputText [(ngModel)]="filter.oaiIdentifier" i18n-placeholder placeholder="Identifier" (keydown.enter)="applyFilter()"/></ng-template></p-columnFilter>

source: Validation <p-columnFilter field="isValid" display="menu" [showAddButton]="false" [showMatchModes]="false" [showOperator]="false" [showClearButton]="false" (onApply)="applyFilter()"><ng-template pTemplate="filter"><p-dropdown [options]="validOptions" [(ngModel)]="selectedValidation" optionLabel="name" i18n-placeholder placeholder="Validation" (ngModelChange)="filter.isValid = $event.value"></p-dropdown></ng-template></p-columnFilter>
es: Validación <p-columnFilter field="isValid" display="menu" [showAddButton]="false" [showMatchModes]="false" [showOperator]="false" [showClearButton]="false" (onApply)="applyFilter()"><ng-template pTemplate="filter"><p-dropdown [options]="validOptions" [(ngModel)]="selectedValidation" optionLabel="name" i18n-placeholder placeholder="Validation" (ngModelChange)="filter.isValid = $event.value"></p-dropdown></ng-template></p-columnFilter>

source: Transformed <p-columnFilter field="transformed" display="menu" [showAddButton]="false" [showMatchModes]="false" [showOperator]="false" [showClearButton]="false" (onApply)="applyFilter()"><ng-template pTemplate="filter"><p-dropdown [options]="transformedOptions" [(ngModel)]="selectedTransformedOption" optionLabel="name" i18n-placeholder placeholder="Transformed" (ngModelChange)="filter.isTransformed = $event.value"></p-dropdown></ng-template></p-columnFilter>
es: Transformado <p-columnFilter field="transformed" display="menu" [showAddButton]="false" [showMatchModes]="false" [showOperator]="false" [showClearButton]="false" (onApply)="applyFilter()"><ng-template pTemplate="filter"><p-dropdown [options]="transformedOptions" [(ngModel)]="selectedTransformedOption" optionLabel="name" i18n-placeholder placeholder="Transformed" (ngModelChange)="filter.isTransformed = $event.value"></p-dropdown></ng-template></p-columnFilter>

source: {VAR_SELECT, select, true {Valid} false {invalid}}
es: {VAR_SELECT, select, true {Válido} false {inválido}}

source: Invalid mandatory rules
es: Reglas obligatorias no válidas

source: Invalid not mandatory rules
es: Reglas no obligatorias no válidas

source: Valid occurrences
es: Ocurrencias válidos

source: Valid
es: Válido

source: Invalid occurences
es: Ocurrencias no válidas

source: Invalid
es: No válido

source: Show rules
es: Mostrar reglas

source: Description
es: Descripción

source: Mandatory
es: Obligatorio

source: Conformity
es: Conformidad

source: Valid record
es: Registro válido

source: <b>Yes</b>
es: <b>Sí</b>

source: Invalids
es: Inválidos

source: {VAR_SELECT, select, true {Validations not found} false {Enter a source acronym in the root URL /:acronym}}
es: {VAR_SELECT, select, true {Validaciones no encontradas} false {Introducir un acrónimo fuente en la URL raíz /:acrónimo}}

source: Total records harvested
es: Total de registros cosechados

source: Records
es: Registros

source: Total valid records
es: Total de registros válidos

source: Total invalid records
es: Total de registros no válidos

source: Validation table
es: Tabla de validación

source: The graph below shows the result of the validations performed. Records with 100% validation level refer to records that have complied with the mandatory harvest rules of the repository and become valid records. Records that have a 0.00% validation level refer to records that did not comply with the mandatory harvest rules of the repository and became invalid records. In this case, the user has the option of viewing which were the invalid occurrences in the details button, where the metadata value with the corresponding quantities are shown.
es: El siguiente cuadro muestra los resultados de las validaciones realizadas tanto de acuerdo a las reglas de validación obligatorias como a las no obligatorias. Junto a cada regla observará el porcentaje de cumplimiento de la totalidad de registros validados así como la magnitud real de registros considerados válidos. Al hacer clic sobre el botón "Inválidos" se accederá a una nueva ventana con todos los detalles de los registros considerados inválidos para dicha regla. Para cada regla que cuente con registros no válidos, el usuario tiene la opción de acceder a los detalles haciendo clic en el botón correspondiente. Allí, se presentarán los valores de los metadatos junto con las cantidades asociadas. Además se cuenta con la posibilidad de filtrar los resultados según el tipo de regla (obligatoria y no obligatoria).

source: Records table
es: Tabla de registros

source: The data below presents the complete diagnosis of your institution's data harvest. Here you can check which records are valid, which are invalid and what makes a record invalid. In addition to allowing a customized view, in which it is possible to make combinations between the type of record (valid or invalid) and the type of rule. In the details button, it is possible to view the applicability and compliance of each validation rule item by item.
es: A continuación, se presentan los datos completos del diagnóstico de la cosecha de metadatos más reciente. Aquí podrá verificar qué registros son considerados válidos y cuáles no, además de comprender las razones por las cuales un registro fue declarado inválido. El sistema permite una vista personalizada, lo que significa que puede realizar combinaciones entre el tipo de registro (válido o no válido) y el tipo de regla. De esta manera, podrá analizar y obtener información específica según sus necesidades. Para obtener detalles adicionales, puede hacer clic en el botón de detalles. Allí encontrará información detallada sobre la aplicabilidad y el cumplimiento de cada regla de validación, registro por registro.
